FSI/3D_Tube/Fluid/system/controlDict

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object controlDict;
}

application pimpleFoam;
//application pimpleDyMFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 0.5;

deltaT 0.0001;

writeControl timeStep;

writeInterval 10;

purgeWrite 0;

writeFormat ascii;

writePrecision 14;

writeCompression uncompressed;

timeFormat general;

timePrecision 8;

runTimeModifiable yes;

adjustTimeStep no;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}
