FSI/3D_Tube/Fluid/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      flowProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              nu [0 2 -1 0 0 0 0] 3e-6;

rho             rho [1 -3 0 0 0 0 0] 1000;

transportModel Newtonian;

// ************************************************************************* //
